Revit 2026 API

# SweptProfileGetSweptProfile Method

---

Returns an object that describes the profile that is swept along the driving curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Profile GetSweptProfile()
```
```vb
Public Function GetSweptProfile As Profile
```
```cpp
public:
Profile^ GetSweptProfile()
```
```fsharp
member GetSweptProfile : unit -> Profile
```

#### Return Value

Profile A geometric profile object.

The profile is swept perpendicular to the driving curve.

#### Reference

SweptProfile Class

Autodesk.Revit.DB Namespace